create_clock -period 1000.000 -name clk -waveform {0.000 500.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 11.000 [get_ports adc_comp]
set_input_delay -clock [get_clocks clk] -max -add_delay 15.000 [get_ports adc_comp]
set_input_delay -clock [get_clocks clk] -min -add_delay 11.000 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -max -add_delay 15.000 [get_ports rst_n]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {adc_channel_sel[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 15.000 [get_ports {adc_channel_sel[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {adc_vref[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 15.000 [get_ports {adc_vref[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports adc_sample]
set_output_delay -clock [get_clocks clk] -max -add_delay 15.000 [get_ports adc_sample]
